---
kind: property
id: P:Autodesk.Revit.DB.IConnector.CoordinateSystem
source: html/83c23e11-64cf-0d4c-1233-d90f69c7de8e.htm
---
# Autodesk.Revit.DB.IConnector.CoordinateSystem Property

The coordinate system of the connector.

## Syntax (C#)
```csharp
Transform CoordinateSystem { get; }
```

## Remarks
The Z axis of the coordinate system is the normal to the plane of the connector.